{
      "Events": [
            {
                  "name": "HuangJin",
                  "content": "汉灵帝光和七年（公元184年），时朝廷腐败、宦官外戚争斗不止、边疆战事不断，国势日趋疲弱，又因全国大旱，颗粒不收而赋税不减，走投无路的贫苦农民在巨鹿人张角的号令下，纷纷揭竿而起，他们头扎黄巾，高喊“苍天已死，黄天当立，岁在甲子，天下大吉”的口号，向官僚地主发动了猛烈攻击，并对东汉朝廷的统治产生了巨大的冲击，为平息叛乱，各地拥兵自重，虽最终起义以失败而告终，但军阀割据、东汉名存实亡的局面也不可挽回，最终导致三国局面的形成。而张角也在同年10月病逝。"
            },
            {
                  "name": "ShiBaLu",
                  "content": "中平六年（公元189年），掌政的董卓废少帝刘辩，拥立其弟陈留王刘协为帝，实行恐怖统治。关东各地方群雄见此，以讨董为名起兵，推举袁绍为盟主，共计18路诸侯。虽然曹操出兵，及后到的孙坚夺战，但其他军队只驻军不加援助，而董卓又放弃洛阳，挟天子迁都长安，关东军起了内讧，联军决裂，形成群雄割据的局面。"
            },
            {
                  "name": "CaoCaoXie",
                  "content": "袁绍谋臣沮授曾劝说袁绍，如果能“西迎大驾，挟天子而令诸侯”，就会收到没有谁“能御之”的功效。袁绍偏偏不听，觉得献帝刘协是个废物。袁绍虽然空有雄兵猛将，却不懂军事不过是政治的工具，最后难免失败。<br />而曹操更是早有此识。献帝东迁后，曹操觉得机会来了，当时宫中食用困乏，曹操便经常向献帝进献食品和器物。献帝还在洛阳时，曹操就曾向他进献。献帝都许后，曹操更是经常进献。<br />建安元年（公元196年），汉献帝迁都于许昌。曹操对献帝的物质保障和适度尊重，得到了他所期待的巨大回报。献帝授给曹操节钺，录尚书事，任司隶校尉，迁都许昌后，又任命他为大将军，实际获取了高出于所有文臣武将的地位。<br />建安元年八月，曹操进驻洛阳，立刻趁张杨、杨奉兵众在外，赶跑了韩暹，接着做了三件事：杀侍中台崇、尚书冯硕等，谓“讨有罪”；封董承、伏完等，谓“赏有功”；追赐射声校尉沮俊，谓“矜死节”。然后在第九天趁他人尚未来得及反应的情况下，迁帝都许，使皇帝摆脱其他势力的控制。此后，他还加紧步伐剪除异己，提高自己的权势。他首先向最有影响力的三公发难，罢免太尉杨彪、司空张喜；其次诛杀议郎赵彦；再次是发兵征讨杨奉，解除近兵之忧；最后是一方面以天子名义谴责袁绍，打击其气焰，另一方面将大将军让予袁绍，稳定大敌。"
            },
            {
                  "name": "GuanDu",
                  "content": "官渡之战初期，建安五年（公元200年）二月，袁绍进军黎阳，派大将颜良进围白马，攻东郡太守刘延，以保障主力渡河南进。刘延告急请援。四月，曹操为解除侧翼威胁，北救刘延。谋士荀攸建议，率军先佯装在延津(今河南汲县东)渡河，做出袭击袁军后方的姿态，诱使袁绍分兵延津。然后，轻兵急进，奔袭白马，攻其不备。曹操依行其计，袁绍果然分兵向西，挺进延津。曹操趁机引兵向白马疾进，及距白马10余里时，颜良大为震惊，仓促迎战。曹操派将军张辽、关羽率先进击，关羽跃马阵前，望见颜良麾盖，直冲过去，在万众之中刺死颜良，斩其首级而归。曹操挥令大军冲杀，袁军大败溃散，遂解白马之围。曹军虽于白马、延津两败袁军，但是袁绍大军连营而进，东西数十里，依沙堆为屯，于是整体局势仍对曹军不利，曹操退守官渡，袁军集结在阳武，与曹军相攻数月，曹军粮草渐尽，袁绍谋士许攸因向袁绍献偷袭许都之计不成，且在河北的家眷犯法被抓，心生悔恨，而来投曹操，献计让曹操偷袭乌巢。曹操大喜，跣足出迎，之后亲率精锐步骑五千人，军队人衔枚，马勒口，换袁军军装乘夜从小路偷袭乌巢。曹操军至乌巢，命四面放火，袁军大乱，淳于琼拒营死守。袁绍闻知，急忙派兵救援，曹操左右见“贼骑稍近，请分兵拒之。”曹操大怒说：“贼在背后，乃白！”士卒都拼死力战，因此大破袁军，斩淳于琼等，尽燔其粮草。而当袁绍听说曹操袭击乌巢时，认为这正是攻破曹操大营的好机会，因此派去的援兵很少，而以重兵围攻曹操大营。由于曹操预留兵力精且多，曹营未破，乌巢败讯已经传来，大将张郃、高览等人率部投降曹操，袁军溃散。袁绍弃军逃回黄河以北。曹军大获全胜，坑杀袁军俘虏七万人。"
            },
            {
                  "name": "WuHeng",
                  "content": "官渡之战后,袁绍病亡,其子袁尚、袁熙投奔乌桓族，以图再起。曹操为消灭袁氏残余势力,巩固北方，于建安十一年(公元206年)开凿沟通呼沱河、鲍丘水的平虏、泉州二渠，以输送军需。次年夏，曹操统军出无终，东攻乌桓。时雨涝道路阻塞，乌桓军扼守要道，曹军受阻。曹操采纳当地名士田畴出偏僻小道以攻其不备的建议，乃回师，诈称待秋冬进军。乌桓军因此戒备松弛。曹操以田畴率部曲为向导，上徐无山，轻骑出卢龙塞，于崇山峻岭中疾行数百里。八月，进至距柳城约200里处,乌桓单于蹋顿等仓皇调集数万骑迎击。两军于白狼山遭遇。曹操登高审势，见乌桓军阵列不整，遂以帅旗授张辽，令其统军急袭。乌桓军猝遭打击，顿时大乱，蹋顿被斩，全军崩溃。曹操乘胜攻占柳城后还师，并迁乌桓及汉民众20余万入塞。袁氏兄弟率数千骑投奔辽东太守公孙康。公孙康为结好曹操，斩袁氏兄弟。"
            },
            {
                  "name": "ChiBi",
                  "content": "曹操败袁绍、破乌桓，基本统一北方后，于建安十三年（公元208年），自宛(今河南南阳)挥师南下，欲先灭刘表，再顺长江东进，击败孙权，以统一天下。九月，曹军进占新野(今属河南)，时刘表已死，其子刘琮不战而降。依附刘表屯兵樊城(今属湖北)的刘备仓促率军民南撤。曹操收编刘表部众，号称八十万大军向长江推进。刘备在长(今湖北当阳境)被曹军大败后，于退军途中派诸葛亮赴柴桑(今江西九江西南)会见孙权，说服孙权结盟抗曹。<br />孙权命周瑜为主将，程普为副，率三万精锐水军，联合屯驻樊口(今湖北鄂州境)的刘备军，共约五万人溯长江西进，迎击曹军。十一月，孙刘联军与曹军对峙于赤壁。曹操将战船首尾相连，结为一体，以利演练水军，伺机攻战。周瑜采纳部将黄盖所献火攻计，并令其致书曹操诈降，曹操中计。黄盖择时率蒙冲斗舰乘风驶入曹军水寨纵火。曹军船阵被烧，火势延及岸上营寨，孙刘联军乘势出击，曹军死伤过半，遂率部北退，留征南将军曹仁固守江陵。联军乘胜扩张战果，孙刘两军分占荆州要地。<br />赤壁决战，曹操在有利形势下，轻敌自负，指挥失误，终致战败。孙权、刘备在强敌进逼关头，结盟抗战，扬水战之长，巧用火攻，终以弱胜强。此战为日后魏、蜀、吴三国鼎立奠定了基础。"
            },
            {
                  "name": "WeiNan",
                  "content": "建安十六年（公元211年）三月，曹操传令，让镇守长安的钟繇讨伐张鲁，并派夏侯渊出河东会合钟繇。此时，夏侯渊和徐晃刚刚平定太原商曜的叛乱，军队可以沿汾河出河东。讨伐张鲁，将有可能经过关中诸将马超等人的防地。高柔为此提醒曹操，但曹操未予理睬。<br />曹操派遣曹仁督各将领前往抵挡，敕令他不要和敌人对战。秋七月，曹操亲统大军西征，八月，曹操大军到达潼关。此时曹军的粮草由洛阳经函谷供应。曹操用大军紧逼潼关，摆出非要从潼关进入关中不可的架势，马超等关中联军的注意力才能被牢牢地吸引在潼关的防守上。<br />经过一段时间的相持，眼见联军的所有力量都已集中到潼关，曹操暗中却派徐晃、朱灵率步骑四千人渡过浦阪津，据河西为营，准备接应曹操大军由河东进入河西。<br />徐晃刚刚从浦阪津渡过黄河，还没来得及建立寨栅，当夜梁兴即领步骑五千多人前来攻击，被徐晃击败。曹操与徐晃约好，在曹操从潼关北渡时，徐晃方才能从浦阪津西渡黄河。马超看到曹操北渡，自然知道曹操是想从浦阪津渡河进入关中，遂派梁兴带五千多人前去抢占浦阪津渡口西岸，通常情况下，这五千人足以阻挡曹操渡河。但马超没有料到的是，徐晃已经抢先占领了浦阪津渡口西岸。经长途急行军赶到浦阪津渡口的梁兴军，自然不是以逸待劳的曹军对手。 待消息经几百里路传回潼关时，马超再想派大军去重新夺回渡口，时间已经来不及了。西渡黄河后，曹操沿河连车树栅为甬道向南推进。马超退屯渭口。曹操又多设疑兵，吸引马超的注意力，暗中却从黄河把船驶入渭河，连夜用船搭起浮桥，分兵在渭水南岸扎营。关中联军乘夜攻营，被曹操伏兵所破。<br />由于韩遂、马超等在春季三月时，就在潼关屯集十万大军，加之用于长途输送粮草的人力，关中各部，当年的农业生产几乎全废。此时秋季已过，冬季将临，关中各部却征收不上来新粮，全军有断炊之虞。<br />于是关中联军为免作持久战，只好割地、送子质请和。谋士贾诩认为可以假装答应他们，曹操问他有何计策，贾诩离间他们。曹操明白他的意思，便应许联军的请求。因之前与韩遂有交情，故施计离间韩遂与马超。后曹操立即与马超、韩遂等约期会战，而马超、韩遂等也急于结束对峙状态。曹操先以轻兵前往挑战，大战了很久，曹军以虎豹骑夹击联军，联军大败，曹军斩杀了成宜、李堪等人。结果韩遂、马超、梁兴败走凉州，杨秋则前往安定，程银、侯选南入汉中投靠张鲁。渭南之战到此结束。关中各郡进入了朝廷直接掌控的范围。"
            },
            {
                  "name": "YiZhouZhi",
                  "content": "建安十六年（公元211年），益州牧刘璋闻听曹操即将进攻汉中郡（今陕西汉中东）张鲁，恐怕危及益州（今四川成都），惊惧不安。谋士张松早对刘璋怀有二心，乘机劝刘璋迎接同宗刘备至益州，以使刘备进攻汉中，打败张鲁，抵御曹操。刘璋大以为然，于是派谋士法正去荆州迎接刘备。法正对刘璋已有二心，即劝刘备将益州夺为己有。刘备遂留诸葛亮、关羽等人镇守荆州，亲率数万大军进入州。刘璋命令所属郡县沿途供应军粮辎重。刘备军至涪城（今四川绵竹东北），刘璋率步骑三万和刘备相会。时法正和刘备谋士庞统皆劝刘备乘此机会除掉刘璋，益州唾手可得，但刘备认为自己初入益州，没有威信，时机不成熟，不能动手。刘璋在涪城与刘备欢宴百日，然后给刘备补充军队，供给粮草辎重，使其进攻张鲁。刘备遂率军北进，驻军葭萌（今四川广元西南），不向张鲁发动进攻，而在当地树恩立德，收买人心，准备夺取益州。<br />刘璋派部将刘璝、泠苞、张任、邓贤、吴懿等抵抗刘备，都被击败，退守绵竹，吴懿向刘备大军投降。刘璋又派护军南阳人李严、江夏人费观统帅驻在绵竹的各路军马，但李严、费观也率领自己的部下向刘备投降。刘备军队的势力更加强大，分派部下将领去占领周围各县。刘璝、张任与刘璋的儿子刘循退守雒城，刘备进军把雒城围住。张任率军出城，在雁桥与刘备军大战，张任军战败，张任战死。<br />建安十九年（公元214年），诸葛亮留关羽留守荆州，与张飞、越云率兵溯长江而上，攻克巴东。至江州，打败并生擒了巴郡太守严颜。张飞命令左右部属把严颜拉出去斩首，严颜却形容举止不变，张飞佩服严颜的胆魄，将他释放，并让他做自己的宾客。诸葛亮派遣赵云经外水出兵平定江阳、犍为，派张飞平定巴西、德阳。<br />刘备围攻雒城近一年，庞统被流矢射中而死。法正写信给刘璋，分析了形势强弱。刘璋未予答复。刘备攻破雒城，进而包围了成都。诸葛亮、张飞、赵去也率兵前来会合。<br />刘备包围成都数十天，派从事中郎涿郡人简雍进城劝降刘璋。此时城中还有精兵三万人，粮食和丝帛可以支持一年，官吏和百姓都愿死战到底。刘璋却命令打开城门，和简雍同乘一辆车出来投降，部属无不伤心落泪。刘备把刘璋安置在公安这个地方，归还他的全部财物，让他佩带振威将军印绶。"
            },
            {
                  "name": "GuanYuDa",
                  "content": "建安二十三年（公元218年）10月，南阳百姓因不堪剥削暴动，宛守将侯音乘机叛乱，致函关羽求助；关羽反映迟钝，侯音为曹仁所擒杀。建安二十四年（公元219年）7月，关羽受刘备取汉中胜利鼓舞，北上取襄樊；曹操以于禁为将，督7军救曹仁，同时命徐晃率军进驻宛城。8月，山洪爆发，淹于禁等7军，关羽乘机攻击，庞德不降被杀，于禁投降；曹仁沉白马坚守樊城。关羽以偏将攻襄阳，自己亲自攻打樊城，并于樊城北布下阵地，以防北方曹军援兵；同时派人向附近郡县策反，荆州刺吏胡修、南乡太守傅方投降，许昌以南部分官吏也暗中策应关羽；陆浑人孙狼聚众暴动，响应关羽，邺城魏讽乘机企图发动政变；即所谓“威镇华夏”。曹操听取司马懿、蒋济等人意见，与孙权结盟，同时命徐晃率军救曹仁，并命名将张辽火速援曹仁。孙权故意派陆逊代吕蒙，关羽大意，遂抽走荆州部分守军；闰十月，孙权令吕蒙为大督，率军袭取江陵，孙皎后继，另派右护军蒋钦督水军进入沔水(汉水)，防关羽顺流而下。吕蒙至寻阳(今湖北黄梅西南)，将战舰伪装成商船，兵士扮为商人，昼夜兼程。至公安，迫蜀守将傅士仁归降，继用傅士仁劝降了江陵守将糜芳，并厚待关羽将士眷属，释放关羽俘获的魏军将士，抚慰百姓。同时，令陆逊进至夷陵(今宜昌境)，西防刘备。徐晃到前线后，与曹仁取得联系，曹仁军士气大增；为离间孙刘，从中渔利，乃令部将将孙权来信射入关羽营中，关羽见后，犹豫不决，军心动遥徐晃乘机大举进攻关羽据点，大破关羽，并乘机打通樊城路线。是时，洪水退，曹仁引军配合徐晃攻击关羽，文聘从水路短关羽粮道，关羽节节败退。关羽知荆州已失，急忙退军，士兵得知家属获厚遇，士气剧降；后关羽败亡麦城。"
            },
            {
                  "name": "HanZhongZhi",
                  "content": "建安二十四年（公元219年），刘备放弃阳平关，南渡沔水，于定军山扎营，夏侯渊率军来抢定军山。<br />刘备派军趁夜火烧夏侯渊营鹿角。夏侯渊派张郃守东围，自己守南围。刘备调一万多兵马分为十部，猛攻张郃，张郃亲身搏战，刘备一时难以攻克。夏侯渊亲自率领精兵来救张郃，刘备派黄忠攻打夏侯渊，黄忠乘着地势高，鼓噪大喊，奔袭夏侯渊，夏侯渊军与黄忠军短兵相接。夏侯渊及益州刺史赵颙等，都被黄忠军斩杀。<br />夏侯渊战死后，汉中曹军惶恐不安，郭淮、杜袭等推举张郃暂时统领汉中诸军，以安众心。张郃率军驻守阳平关。<br />曹刘对峙<br />刘备击斩夏侯渊后，打算渡汉水来攻郭淮，郭淮部下见己方兵力过少，难以匹敌，建议郭淮可依汉水结阵。但郭淮却认为这是示弱，应该远离汉水结阵，趁刘备军半渡时袭击。但刘备见到郭淮的结阵方式，没有渡水。<br />三月，曹操率领大军抵达汉中地界，进驻阳平关。<br />刘备踌躇满志，说即使曹操亲自前来，也不能改变什么，自己一定会拥有汉中。刘备在山上扎营，占据险要，固守不战，与曹操对持。<br />曹操来争汉中，将数千万囊粮草搬运到北山囤积。<br />时黄忠在赵云营内。黄忠见曹操运送了这么多的粮草，于是建议赵云可以去劫取。但曹操的囤粮重地，应该是有重兵把守，为谨慎起见，赵云与黄忠约定期限，然后再让黄忠领兵去劫粮。黄忠果然中了曹操军的埋伏，赵云率领轻骑前往救出黄忠、张著等回营。曹军紧追不舍，直到赵云营前，赵云大开营门，偃旗息鼓，曹军怀疑赵云设有伏兵，引军退走，赵云趁机反击，曹军惊骇，自相践踏，死伤极多。<br />后来，刘备开始主动出击，派刘封于阳平关前叫阵，曹操大骂刘备常派义子出战，称自己可用黄须儿曹彰来与刘封一战。曹操于是派人去召曹彰来援汉中。<br />五月，曹彰日夜兼程，赶至长安。但曹操已经撤出汉中。<br />汉中之战以刘备的胜利而结束。秋七月，刘备称汉中王。"
            },
            {
                  "name": "XiangFanZhi",
                  "content": "建安二十四年（公元219年），关羽率领部队攻打荆州北部樊城，曹操派出大将于禁率领七军援救襄樊。立义将军庞德与关羽交战，引箭射中关羽前额。其时庞德常乘白马，关羽军皆谓之白马将军，对他甚为忌惮。到了八月，连绵大雨，汉水暴涨，水高五至六丈，于禁所率领的七军全为汉水所淹。于禁、庞德上高处回避。关羽乘机领水军攻击于禁、庞德，于禁等无处可逃，于是投降。关羽乘船至城下，立即将樊城重重包围，使其内外断绝。关羽又派别的将领把将军吕常包围在襄阳。荆州刺史胡修、南乡太守傅方都投降了关羽。十月，陆浑民孙狼等作乱，杀死了县主簿，向南归附关羽。关羽授给孙狼官印，给他军队，让他去扰乱曹魏。关羽的威名震动了整个中原。<br />曹操听从下属建议，派人劝孙权威胁关羽的后方，答应孙权把江南封给他，为解除樊城之围。<br />关羽得到于禁等人的军队数万人，粮食不足，军队断粮，便擅自取用孙权湘关的粮米；孙权闻知此事，便派兵袭击关羽。关羽派兵驻扎偃城，徐晃军队到达后，通过隐秘的小径围绕偃城，掘一道长壕，表示要截断关羽守军的后路，关羽守军便烧毁营盘退走了。徐晃占据偃城后，连结军营逐渐向前推进。曹操派赵俨以议郎的身份参与曹仁的军事部署，和徐晃所部一同前进，而其余的救兵尚未赶到。徐晃率领的军队没有足够的力量解樊城之围，而将领们却呼叫着责备徐晃，催促他去救曹仁。徐晃在距关羽的包围圈三丈之外的地方，扎下营盘，挖地道和射箭书通知曹仁，多次沟通消息。孙权写信给曹操，请求允许他讨伐关羽，并请求不要把消息泄露出去。曹操问群臣，群臣都说应当保密，董昭却建议使泄露出去为好。关羽为人强悍，一定不会很快退兵。曹操立即下令徐晃将孙权的书信用箭射入围城之内和关羽军营中。被围的将士得到书信后，士气增长百倍，关羽果然犹豫不决，不愿撤兵离去。<br />曹操从洛阳南下解救曹仁，同意桓阶的话，驻扎在摩陂，先后派遣殷署、朱盖等共十二营军队到徐晃那里增援。关羽在围头派有军队驻守，在四冢还有驻军。徐晃于是扬言将进攻围头，却秘密攻打四冢。关羽见四冢危急，便亲自率领步、骑兵五千人出战，徐晃迎击，关羽退走。关羽在堑壕前围有十重鹿角，徐晃追击关羽，二人都进入关羽对樊城的包围圈，包围圈被打破，傅方、胡修都被杀死，关羽于是撤围退走，然而关羽的船只仍据守沔水，去襄阳的路隔绝不通。<br />吕蒙到达寻阳，将关羽设置在江边守望的官兵都捉了起来，关羽对吕蒙的行动一无所知。麋芳、士仁投降吕蒙。吕蒙到达江陵，把被囚的于禁释放，俘虏了关羽及其将士们的家属，对他们都给以抚慰。吕蒙帐下有一亲兵，从百姓家中拿了一个斗笠遮盖官府的铠甲，吕蒙流着眼泪将这个亲兵处斩了。于是全军震恐战惊。南郡因此道不拾遗。<br />关羽得知南郡失守后，立即向南回撤。关羽多次派使者与吕蒙联系，吕蒙每次都厚待关羽的使者，允许在城中各处游览，向关羽部下亲属各家表示慰问，有人亲手写信托他带走，作为平安的证明。使者返回，关羽部属私下向他询问家中情况，尽知家中平安，所受对待超过以前，因此关羽的将士都无心再战了。正在此时，孙权到达江陵，荆州的文武官员都归附。<br />关羽自知孤立困穷，便向西退守麦城。孙权派人诱降，关羽伪装投降，把幡旗做成人像立在城墙上，然后逃遁，士兵都跑散了。跟随他的只有十余名骑兵。孙权已事先命令朱然、潘璋切断了关羽的去路。十二月，潘璋手下的司马马忠在章乡擒获关羽及其儿子关平，予以斩首，于是，孙权占据荆州。"
            },
            {
                  "name": "YiLingZhi",
                  "content": "章武元年（公元221年）7月，刘备亲率蜀汉军队数万人，对吴国发动了大规模的战争。<br />孙权在面临蜀军战略进攻的情况下，奋起应战。陆逊上任后，通过对双方兵力、士气以及地形诸条件的仔细分析，说明吴军应暂时避开蜀军的锋芒，再伺机破敌。孙权果断地实施战略退却，一直后撤到夷道、猇亭一线。然后在那里停止退却，转入防御，遏制蜀军的继续进兵。并集中兵力，准备相机决战。这样，吴军完全退出了高山峻岭地带，把兵力难以展开的数百里长的山地留给了蜀军。<br />章武二年（公元222年）正月到六月，两军相持不决。刘备为了迅速同吴军进行决战，曾频繁派人到阵前辱骂挑战，但是陆逊均沉住气不予理睬。蜀军将士逐渐斗志涣散松懈，失去了主动优势地位。由于蜀军是处于吴境二三百公里的崎岖山道上，远离后方，故后勤保障多有困难，且加上刘备百里连营，兵力分散，从而为陆逊实施战略反击提供了可乘之机。<br />陆逊看到蜀军士气沮丧，放弃了水陆并进、夹击蜀军的作战方针，认为战略反攻的时机业已成熟。为此他上书吴王，孙权当即批准了陆逊这一由防御转入反攻的作战计划。决战开始后，陆逊即命令吴军士卒各持茅草一把，乘夜突袭蜀军营寨，顺风放火。顿时间火势猛烈，蜀军大乱。陆逊乘势发起反攻，迫使蜀军西退。后各队兵力逐一击破蜀军，刘备见全线崩溃，逃往夷陵西北马鞍山，命蜀军环山据险自卫。陆逊集中兵力，四面围攻，又歼灭蜀军近万之众。至此，蜀军溃不成军，大部死伤和逃散，车、船和其他军用物资丧失殆尽。刘备乘夜突围逃遁，行至石门山，被吴将孙桓部追逼，几乎被擒，后卫将军傅肜等被杀。后依赖驿站人员焚烧溃兵所弃的装备堵塞山道，才得以摆脱追兵，逃入永安城中。<br />这时，蜀军镇北将军黄权所部正在江北防御魏军。刘备败退后，黄权的归路为吴军所截断，不得已于八月率众向曹魏投降。同月，马良由南方往西北撤退时被步骘截击而死。<br />此战，刘备军几乎全军覆没，阵亡数万人，《傅子》更是记载吴军消灭蜀汉军八万余，刘备仅以身免。<br />刘备逃到白帝城后，吴将潘璋、徐盛等人都主张乘胜追击，扩大战果。但此时刘备收拢散兵以及赵云的后军来援，永安驻军接近两万，陆逊已经失去攻克永安的机会。再加上他顾忌曹魏方面乘机浑水摸鱼、袭击后方，遂停止追击，主动撤兵。九月，曹魏果然攻吴，但因陆逊早有准备，魏军终于无功而返。次年四月，刘备恼羞于夷陵惨败，一病不起，亡故于白帝城。夷陵之战就这样结束了。"
            },
            {
                  "name": "ZhuGeLiangBei",
                  "content": "公元228-234年，诸葛亮先后北伐5次，反击1次。<br />建兴六年（公元228年）春<br />诸葛亮事先扬声走斜谷道取郿，让赵云邓芝设疑兵于斜谷，吸引曹真重兵，自己率大军攻祁山。陇右的南安、天水和安定三郡反魏附蜀。张郃出拒，大破马谡于街亭，王平独木难支，诸葛亮只好退兵。诸葛亮拔西县千余家返回汉中。<br />同年冬<br />诸葛亮兵出散关（陕西宝鸡市西南）围陈仓（宝鸡市东），粮尽而退还汉中。魏将王双来追，被魏延所斩。<br />建兴七年（公元229年）春<br />诸葛亮遣陈式攻武都（甘肃省成县周边）、阴平（甘肃省文县周边）二郡。雍州刺史郭淮引兵救之，亮自出至建威（甘肃省西和县西），郭淮退。遂得二郡。<br />建兴八年（公元230年）秋<br />魏军三路进攻汉中，司马懿走西城（陕西省安康县西北），张郃走子午谷，曹真走斜谷。诸葛亮驻军于城固、赤坂。时大雨三十余天，魏军撤退。诸葛亮使魏延、吴懿西入羌中，大破魏后将军费曜、雍州刺史郭淮于阳溪。<br />建兴九年（公元231年）二月<br />诸葛亮率大军攻祁山，始以木牛运。时曹真病重，司马懿都督关中诸将出拒。诸葛亮割麦于上邽。司马懿追亮至卤城，掘营自守，有“畏蜀如畏虎”之讥。五月，司马懿与诸葛亮交兵，魏延等将斩获敌甲首三千级，玄铠五千领，角弩三千一百张。六月，李严因运粮不济呼亮还。诸葛亮在木门道设计，连弩射杀为名将张郃。李严废为平民。<br />建兴十二年（公元234年）二月<br />诸葛亮率大军出斜谷道，据武功五丈原（陕西省岐山南），屯田于渭滨。司马懿据守不出。八月，诸葛亮卒于五丈原。杨仪等率军还，有“死诸葛走生仲达”事。魏延因与杨仪不和，谋反罪诛杀魏延。"
            },
            {
                  "name": "JiangWeiBei",
                  "content": "章武元年（公元221年）7月，刘备亲率蜀汉军队数万人，对吴国发动了大规模的战争。<br />孙权在面临蜀军战略进攻的情况下，奋起应战。陆逊上任后，通过对双方兵力、士气以及地形诸条件的仔细分析，说明吴军应暂时避开蜀军的锋芒，再伺机破敌。孙权果断地实施战略退却，一直后撤到夷道、猇亭一线。然后在那里停止退却，转入防御，遏制蜀军的继续进兵。并集中兵力，准备相机决战。这样，吴军完全退出了高山峻岭地带，把兵力难以展开的数百里长的山地留给了蜀军。 <br />章武二年（公元222年）正月到六月，两军相持不决。刘备为了迅速同吴军进行决战，曾频繁派人到阵前辱骂挑战，但是陆逊均沉住气不予理睬。蜀军将士逐渐斗志涣散松懈，失去了主动优势地位。由于蜀军是处于吴境二三百公里的崎岖山道上，远离后方，故后勤保障多有困难，且加上刘备百里连营，兵力分散，从而为陆逊实施战略反击提供了可乘之机。<br />陆逊看到蜀军士气沮丧，放弃了水陆并进、夹击蜀军的作战方针，认为战略反攻的时机业已成熟。为此他上书吴王，孙权当即批准了陆逊这一由防御转入反攻的作战计划。决战开始后，陆逊即命令吴军士卒各持茅草一把，乘夜突袭蜀军营寨，顺风放火。顿时间火势猛烈，蜀军大乱。陆逊乘势发起反攻，迫使蜀军西退。后各队兵力逐一击破蜀军，刘备见全线崩溃，逃往夷陵西北马鞍山，命蜀军环山据险自卫。陆逊集中兵力，四面围攻，又歼灭蜀军近万之众。至此，蜀军溃不成军，大部死伤和逃散，车、船和其他军用物资丧失殆尽。刘备乘夜突围逃遁，行至石门山，被吴将孙桓部追逼，几乎被擒，后卫将军傅肜等被杀。后依赖驿站人员焚烧溃兵所弃的装备堵塞山道，才得以摆脱追兵，逃入永安城中。<br />这时，蜀军镇北将军黄权所部正在江北防御魏军。刘备败退后，黄权的归路为吴军所截断，不得已于八月率众向曹魏投降。同月，马良由南方往西北撤退时被步骘截击而死。<br />此战，刘备军几乎全军覆没，阵亡数万人，《傅子》更是记载吴军消灭蜀汉军八万余，刘备仅以身免。<br />刘备逃到白帝城后，吴将潘璋、徐盛等人都主张乘胜追击，扩大战果。但此时刘备收拢散兵以及赵云的后军来援，永安驻军接近两万，陆逊已经失去攻克永安的机会。再加上他顾忌曹魏方面乘机浑水摸鱼、袭击后方，遂停止追击，主动撤兵。九月，曹魏果然攻吴，但因陆逊早有准备，魏军终于无功而返。次年四月，刘备恼羞于夷陵惨败，一病不起，亡故于白帝城。夷陵之战就这样结束了。"
            },
            {
                  "name": "JinMieShu",
                  "content": "魏景元四年（公元263年），江油失守后，刘禅派诸葛瞻抗击邓艾，黄崇劝告诸葛瞻：“宜速行据险，无令敌得入平地。”但诸葛瞻犹豫不决，被邓艾夺取了险地。诸葛瞻督军到涪城并遇魏军发生战斗，邓艾大败诸葛瞻前锋，诸葛瞻被迫退守绵竹。邓艾遣使致书诸葛瞻劝降，诸葛瞻怒斩使者。邓艾立即派其子邓忠及师纂等，从左右两面进攻蜀军。魏军失利，邓艾大怒，扬言要斩邓忠、师纂，命二人再战以将功补过。结果二人大破蜀军，斩杀诸葛瞻及张遵、黄崇等人，魏军进占绵竹，并立即进军成都。<br />当时蜀汉兵多在剑阁，而成都兵少。当蜀君臣闻魏军到来时，皆不知所措。有人建议先逃向南中地区，也有人建议东投孙吴，其中谯周则力主降魏，群臣多附和。十一月，刘禅接受谯周意见，开城降魏，魏军占领成都，同时遣使令姜维等投降，蜀汉正式灭亡。<br />而在坚守剑阁的姜维，先闻邓艾领万人偷渡阴平，但听闻诸葛瞻领成都戍卫军迎敌，虽然对诸葛瞻领兵有所担心，但认为诸葛瞻带领着蜀汉最精锐的兵马，而且兵马超过邓艾一倍，即使不胜也不会失败，因而未派援军回援，专心带兵在剑门关对付三倍于自己兵马的钟会军，之后听闻诸葛瞻全军覆灭，但未知刘禅确切消息，怕直接回师被钟会进攻背后，于是便引军东入巴中绕道赶赴成都。钟会率魏军进驻涪城，另派胡烈、田续、庞会等追赶姜维。姜维再退到郪县，接到了后主刘禅让姜维投降的皇命，姜维便率廖化、张翼、董厥等人投降钟会军。"
            },
            {
                  "name": "JinMieWu",
                  "content": "太康元年（公元280年）十一月，司马炎采用羊祜生前拟制的计划，发兵二十万，分六路进攻吴国。<br />吴主孙皓得知晋王浑率大军南下，即命丞相张悌统率丹阳太守沈莹、护军孙震、副军师诸葛靓率兵3万，渡江迎战，以阻止晋军渡江。张悌军行至牛渚，沈莹向其分析晋军来犯的形势，建议等待晋军前来决战，若能打败晋军，即可阻止晋军渡江，还可西上夺回失地。如若渡过江去与晋军决战，不幸失败，大势必将去矣。但张悌却认为，趁着如今晋大军未到，渡江与其决战，或许还有希望获胜。如若战败身亡，为国牺牲，也就死而无憾了。张悌决心率军渡江迎击晋。吴将沈莹首先率领五千精锐向晋军攻击，三次冲击均未奏效，被晋军斩首二将，不得不退兵。晋军则乘吴军退兵混乱之机，以将军薛胜、蒋班率军追杀，吴军大败。此时，伪降之张乔军又从背后杀来，吴军溃败而逃。诸葛靓见大势已去，收集败兵数百逃回江南。张悌不肯逃走，与沈莹、孙震力战而死，吴军三万多人，被斩近八千人，余皆逃散，晋军遂胜利推进至江边。<br />琅邪王司马伷所率的一路大军，牵制吴军，直攻建业。王恒军进展顺利，一一击破吴沿江守军，歼灭吴军五六万人，俘获吴督蔡机。王濬军在长江上中游获胜之后，便挥军顺流而下，三月十四日到达牛渚。当进至距建业西南五十里时，吴主孙皓才派遣游击将军张象率水军一万前往迎击；但吴军此时已成惊弓之鸟，张象的部队一望见晋军的旌旗便不战而降。王濬的兵甲布满长江，旌旗映亮天空，声势十分盛大，继续向前推进。<br />原先吴主派往交趾征讨郭马的将军陶濬，行至武昌时，听到晋军大举进攻的消息，便停止去交趾，返回了建业，此时，吴主孙皓便授其符节，命其率军二万，迎击晋军。结果，二万军队出兵前夜便逃散一空。<br />此时，王浑、王濬和司马伷等各路大军已逼近吴国京师建业长江的北岸，吴国司徒何值、建威将军孙宴等交出印信符节，前往王浑军前投降。吴主孙皓见自己内部已分崩离析，便采用光禄勋薛莹、中书令胡冲等人的计策，分别派遣使者送信给王浑、王濬、司马伷，请求降服，企图挑唆三人互相争功，引起晋军内部分裂。使者先把印玺送给司马伷。王濬此时正挥军直进，三月十五日行至三山时，王浑派使者命其暂停进军，王濬不理，借口风太大，无法停船为由，扯起风帆直冲建业。当日，王濬统率水陆八万之众，方舟百里，进入建业。吴主孙皓反绑双手、拉着棺木，前往王濬军门投降。至此，晋军连克东吴四州、四十三郡，降服吴军二十三万，东吴政权宣告灭亡，三国长期分裂的局面也随之结束。"
            }
      ]
}